snappy_2d_airfoil/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
xDim    20;
yDim    20;
zDim    0.04;

xMin    #calc "-($xDim / 2.0)";
xMax    #calc "($xDim / 2.0)";
yMin    #calc "-($yDim / 2.0)";
yMax    #calc "($yDim / 2.0)";
//zMin    #calc "-$zDim";
zMin    0.01;
zMax    0.09;

nx      40;
ny      40;
nz      1;

vertices
(
    ($xMin $yMin $zMin) // vertice 0
    ($xMax $yMin $zMin) // vertice 1
    ($xMax $yMax $zMin) // vertice 2
    ($xMin $yMax $zMin) // vertice 3
    ($xMin $yMin $zMax) // vertice 4
    ($xMax $yMin $zMax) // vertice 5
    ($xMax $yMax $zMax) // vertice 6
    ($xMin $yMax $zMax) // vertice 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    right
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    
    bottom
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
