snappy_2d_airfoil/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            patch;
        nFaces          40;
        startFace       3120;
    }
    right
    {
        type            patch;
        nFaces          40;
        startFace       3160;
    }
    left
    {
        type            patch;
        nFaces          40;
        startFace       3200;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       3240;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3200;
        startFace       3280;
    }
)

// ************************************************************************* //
